# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [87]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [89]:
df0_info = pd.read_csv('Students_info_0.csv')
df1_info = pd.read_csv('Students_info_1.csv')
df2_info = pd.read_csv('Students_info_2.csv')
df3_info = pd.read_csv('Students_info_3.csv')
df4_info = pd.read_csv('Students_info_4.csv')
df5_info = pd.read_csv('Students_info_5.csv')
df6_info = pd.read_csv('Students_info_6.csv')
df7_info = pd.read_csv('Students_info_7.csv')
df8_info = pd.read_csv('Students_info_8.csv')
df9_info = pd.read_csv('Students_info_9.csv')
df_info = pd.concat([df0_info, df1_info, df2_info, df3_info, df4_info, df5_info, df6_info, df7_info, df8_info, df9_info], ignore_index = True)

df0_marks = pd.read_csv('Students_marks_0.csv')
df1_marks = pd.read_csv('Students_marks_1.csv')
df2_marks = pd.read_csv('Students_marks_2.csv')
df3_marks = pd.read_csv('Students_marks_3.csv')
df4_marks = pd.read_csv('Students_marks_4.csv')
df5_marks = pd.read_csv('Students_marks_5.csv')
df6_marks = pd.read_csv('Students_marks_6.csv')
df7_marks = pd.read_csv('Students_marks_7.csv')
df8_marks = pd.read_csv('Students_marks_8.csv')
df9_marks = pd.read_csv('Students_marks_9.csv')

df_marks = pd.concat([df0_marks, df1_marks, df2_marks, df3_marks, df4_marks, df5_marks, df6_marks, df7_marks, df8_marks, df9_marks], ignore_index = True)
df = pd.merge(df_info, df_marks, on = 'index', how = 'left')

df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [90]:
df = df.drop(['index'], axis = 1)

In [97]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [98]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [99]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [102]:
df.isnull().any().any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [103]:
df.mean(axis = 0, numeric_only=True)

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [104]:
df.groupby("test preparation course")["math score"].mean() #математика

test preparation course
completed    69.695531
none         64.077882
Name: math score, dtype: float64

In [40]:
df.groupby("test preparation course")["reading score"].mean() #чтение

test preparation course
completed    73.893855
none         66.534268
Name: reading score, dtype: float64

In [41]:
df.groupby("test preparation course")["writing score"].mean() #письмо

test preparation course
completed    74.418994
none         64.504673
Name: writing score, dtype: float64

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [105]:
set(df["lunch"])

{'free/reduced', 'standard'}

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [106]:
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [44]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [107]:
len(df[df['math score'] >= passmark]) / len(df)

0.865

In [108]:
sum((df['math score'] >= passmark) & (df['test preparation'] == 'completed')) / len(df)

0.33

In [118]:
sum((df['gender'] == 'female') & (df['math score'] <= passmark) & (df['test preparation'] == 'none')) / len(df)

0.078

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [146]:
%%timeit
df.groupby('race/ethnicity')['reading score'].mean()

362 µs ± 9.8 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [147]:
%%timeit
df.groupby('education')['writing score'].min()

395 µs ± 6.98 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [128]:
set(df["race/ethnicity"])

{'group A', 'group B', 'group C', 'group D', 'group E'}

In [143]:
%%timeit
sumA = 0
sumB = 0
sumC = 0
sumD = 0
sumE = 0
for i in range(len(df)): #в цикле проходимся по всему столбцу race/ethnicity, при совпадении названия добавляем в общую сумму, в конце делим на общее число принадлежащих к этой группе
    if df.loc[i][1] == 'group A':
        sumA += df.loc[i][7]
    elif df.loc[i][1] == 'group B':
        sumB += df.loc[i][7]
    elif df.loc[i][1] == 'group C':
        sumC += df.loc[i][7]
    elif df.loc[i][1] == 'group D':
        sumD += df.loc[i][7]
    elif df.loc[i][1] == 'group E':
        sumE += df.loc[i][7]
print(sumA / sum(df["race/ethnicity"] == "group A"))
print(sumB / sum(df["race/ethnicity"] == "group B"))
print(sumC / sum(df["race/ethnicity"] == "group C"))
print(sumD / sum(df["race/ethnicity"] == "group D"))
print(sumE / sum(df["race/ethnicity"] == "group E"))

64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
310 ms ± 8.27 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [150]:
pd.pivot_table(df, index = ['gender', 'education'], aggfunc = {'math score': 'mean', 'reading score': 'mean', 'writing score': 'mean'})

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [151]:
def fun(mark): #функция присвоения значения при выполеннии условия
    if mark < passmark:
        return "F"
    else:
        return "T"
df["Math_PassStatus"] = df['math score'].apply(fun) #cоздание столбца по присвоенным функцией значениям

In [152]:
print(sum(df["Math_PassStatus"] == "T")) #математика
print(sum(df["Math_PassStatus"] == "F"))

865
135

In [153]:
df["Reading_PassStatus"] = df['reading score'].apply(fun) #чтение
df["Writing_PassStatus"] = df['writing score'].apply(fun) #письмо

In [154]:
print(sum(df["Reading_PassStatus"] == "T"))
print(sum(df["Reading_PassStatus"] == "F"))
print(sum(df["Writing_PassStatus"] == "T"))
print(sum(df["Writing_PassStatus"] == "F"))

910
90
886
114

In [155]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,T,T,T
1,female,group C,some college,standard,completed,group1,69,90,88,T,T,T
2,female,group B,master's degree,standard,none,group1,90,95,93,T,T,T
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,T,F
4,male,group C,some college,standard,none,group1,76,78,75,T,T,T

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [159]:
def overfun(math, reading, writing): #функция присвоения значения по выполненному условию
    if math > passmark and reading > passmark and writing > passmark:
        return "P"
    else:
        return "F"
df['OverAll_PassStatus'] = df[['math score', 'reading score', 'writing score']].apply(lambda x: overfun(*x), axis = 1) #создание столбца по присвоенным функцией значениям
print(sum(df['OverAll_PassStatus'] == "P"))

796

In [160]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,T,T,T,P
1,female,group C,some college,standard,completed,group1,69,90,88,T,T,T,P
2,female,group B,master's degree,standard,none,group1,90,95,93,T,T,T,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,T,F,F
4,male,group C,some college,standard,none,group1,76,78,75,T,T,T,P

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [161]:
def mean_grade(math, reading, writing): #создание функции и столбца, формирующих средний балл каждого студента
    return (math + reading + writing) / 3
df['mean_grade'] = df[['math score', 'reading score', 'writing score']].apply(lambda x: mean_grade(*x), axis = 1)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus,mean_grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,T,T,T,P,72.666667
1,female,group C,some college,standard,completed,group1,69,90,88,T,T,T,P,82.333333
2,female,group B,master's degree,standard,none,group1,90,95,93,T,T,T,P,92.666667
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,T,F,F,49.333333
4,male,group C,some college,standard,none,group1,76,78,75,T,T,T,P,76.333333

In [162]:
def GetGrade(average_mark): #создание функции и столбца, присваивающих оценку по среднему баллу
    if average_mark > 90:
        return "A"
    elif average_mark >= 80:
        return "B"
    elif average_mark >= 70:
        return "C"
    elif average_mark >= 60:
        return "D"
    elif average_mark >= 50:
        return "E"
    else:
        return "F (Fail)"

df['Grade'] = df['mean_grade'].apply(GetGrade)
df.head()
df.to_csv('df.csv') #сохранение таблицы (ну а вдруг)